Revit 2027 API
Space.SpaceConstruction Property
Get the Space Construction of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSpaceConstruction SpaceConstruction { get; }
Public ReadOnly Property SpaceConstruction As MEPSpaceConstruction
	Get
public:
property MEPSpaceConstruction^ SpaceConstruction {
	MEPSpaceConstruction^ get ();
}
member SpaceConstruction : MEPSpaceConstruction with get
Property Value
MEPSpaceConstruction
Remarks
This property is used to get the Space Construction of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace